artillery.yml
config:
  ensure:
    maxErrorRate: 1
  target: 'http://localhost:4043'
  phases:
    - duration: 60
      arrivalRate: 5
    #   rampTo: 2000
    # - duration: 60
    #   arrivalRate: 3500


  # ramps up to 500 users arriving per second over 120 seconds (maybe there's a sale...)
    # - duration: 2
    #   arrivalRate: 5
    #   rampTo: 3000
  # payload:
  #   path: "keywords.csv"
  #   fields:
  #     - "keywords"        
scenarios:
  - flow:
    - loop: 
      - get:
          url: "/product/{{ $randomNumber(1, 10000) }}"
      - get:
          url: "/product/{{ $randomNumber(10000, 20000) }}"
      - get:
          url: "/product/{{ $randomNumber(20000, 30000) }}"
        count: 500
   

# config:
#   target: "https://staging1.local"
#   phases:
#     - duration: 60
#       arrivalRate: 5
#     - duration: 120
#       arrivalRate: 5
#       rampTo: 50
#     - duration: 600
#       arrivalRate: 50
#   payload:
#     path: "keywords.csv"
#     fields:
#       - "keywords"